О; /* пис ДЗ: Уявімо собі, що ми є власниками великої компанії, яка розробляє платформу для продажу квитків. Окрім того, наша компанія продає рішення для організації продажу цих квитків. Таким чином, у нас будуть клієнти, які придбають наше програмне забезпечення (ПО). По суті, ці клієнти будуть подібні до "дочірніх компаній" (subCompany), які вже використовують наше ПО для продажу квитків. Крім цього, ці "дочірні компанії" також можуть стати постачальниками цього рішення, і в цьому випадку вони вже будуть "внучатами компанії" (subSubCompany), і так далі і далі

Ось приклад об'єкту, зверніть увагу на вкладеність, та маєте на увазі що об'єкт може ставати ще глибшим.
Вам необхідно написати функцію findValueByKey(companyName), яка буде приймати значення у вигляді companyName та надавати інформацію про цю subCompany. */

const company = {
  name: 'Велика Компанія',
  type:'Головна компанія',
  platform: 'Платформа для продажу квитків',
  sellsSolution: 'Рішення для продажу квитків',
  clients: [
    {
      name: 'Клієнт 1',
      type: 'subCompany',
      uses: 'ПО для продажу квитків',
      sells: 'Рішення для продажу квитків',
      partners: [
        {
          name: 'Клієнт 1.1',
          type: 'subSubCompany',
          uses: 'Рішення для продажу квитків',
          sells: 'Рішення для продажу квитків',
        },
        {
          name: 'Клієнт 1.2',
          type: 'subSubCompany',
          uses: 'Рішення для продажу квитків',
          sells: 'Рішення для продажу квитків',
          partners: [
            {
              name: 'Клієнт 1.2.3',
              type: 'subSubCompany',
              uses: 'Рішення для продажу квитків',
              sells: 'Рішення для продажу квитків',
            }
          ]
        }
      ]
    },
    {
      name: 'Клієнт 2',
      type: 'subCompany',
      uses: 'ПО для продажу квитків',
      sells: 'Рішення для продажу квитків'
    }
  ]
}

function findValueByKey(company, companyName) {
  if (company.name === companyName)//шукаємо чи відповідає назва обєкта нашій змінній
  return company; //якщо відповідає то виводимо назву компанії і дані компанії
 for (let key in company) {//перебираємо ключі обєкта
  if(Array.isArray(company[key]))// якщо значення ключа є масивом
  {
    for(let newKey of company[key]){ // перебираємо елементи масиву
      let result = findValueByKey(newKey, companyName);// через рекурсію викливаємо функцію кожного елементу
      if (result)
      return result //якщо знаходимо то повертаємо елемент
    }
  }
 }
 return null;// не знаходимо то повертаємо null
}
 let companyName = 'Клієнт 1.2.3';
 console.log(findValueByKey(company, companyName));